Revit 2027 API
FillGrid.SetSegments Method
 Sets the segments to the fill grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSegments(
	IList<double> segArr
)
Public Sub SetSegments (
	segArr As IList(Of Double)
)
public:
void SetSegments(
	IList<double>^ segArr
)
member SetSegments :
        segArr : IList<float> -> unit
Parameters
segArr IList<Double>
 The segments to be used.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FillGrid Class
Autodesk.Revit.DB Namespace